/*
 * @Author: guangnan.li
 * @Date: 2024-05-30 10:15:03
 * @Version: V1.0
 * @LastEditors: guangnan.li
 * @LastEditTime: 2025-07-10 11:51:22
 * @FilePath: \2.Code\App\Src\animetask.c
 * @Description: 
 * 
 * Copyright (c) 2024 by ${NanNingLiaoWang Ltd.}, All Rights Reserved. 
 */

#include "animetask.h"

const uint8_t Anime_PL_AllOn_Arr[][ANIME_TASK_ARR_LEN] = {
{	13,	13,	13,	13,	13,	13,	13,	13,	13,	13,	13,	13,	13,	13,	13,	13,	},
};
const uint8_t Anime_DRL_AllOn_Arr[][ANIME_TASK_ARR_LEN] = {
{	100,	100,	100,	100,	100,	100,	100,	100,	100,	100,	100,	100,	100,	100,	100,	100,	},
};
const uint8_t Anime_Wel_Arr[][ANIME_TASK_ARR_LEN] = {
{	13,	13,	13,	13,	13,	13,	13,	13,	13,	13,	13,	13,	13,	13,	13,	13,	},
{	26,	26,	26,	26,	26,	26,	26,	26,	26,	26,	26,	26,	26,	26,	26,	26,	},
{	38,	38,	38,	38,	38,	38,	38,	38,	38,	38,	38,	38,	38,	38,	38,	38,	},
{	50,	50,	50,	50,	50,	50,	50,	50,	50,	50,	50,	50,	50,	50,	50,	50,	},
{	63,	63,	63,	63,	63,	63,	63,	63,	63,	63,	63,	63,	63,	63,	63,	63,	},
{	75,	75,	75,	75,	75,	75,	75,	75,	75,	75,	75,	75,	75,	75,	75,	75,	},
{	88,	88,	88,	88,	88,	88,	88,	88,	88,	88,	88,	88,	88,	88,	88,	88,	},
{	100,	100,	100,	100,	100,	100,	100,	100,	100,	100,	100,	100,	100,	100,	100,	100,	},
{	88,	88,	88,	88,	88,	88,	88,	88,	88,	88,	88,	88,	88,	88,	88,	88,	},
{	63,	63,	63,	63,	63,	63,	63,	63,	63,	63,	63,	63,	63,	63,	63,	63,	},
{	38,	38,	38,	38,	38,	38,	38,	38,	38,	38,	38,	38,	38,	38,	38,	38,	},
{	13,	13,	13,	13,	13,	13,	13,	13,	13,	13,	13,	13,	13,	13,	13,	13,	},
{	26,	26,	26,	26,	26,	26,	26,	26,	26,	26,	26,	26,	26,	26,	26,	26,	},
{	38,	38,	38,	38,	38,	38,	38,	38,	38,	38,	38,	38,	38,	38,	38,	38,	},
{	50,	50,	50,	50,	50,	50,	50,	50,	50,	50,	50,	50,	50,	50,	50,	50,	},
{	63,	63,	63,	63,	63,	63,	63,	63,	63,	63,	63,	63,	63,	63,	63,	63,	},
{	75,	75,	75,	75,	75,	75,	75,	75,	75,	75,	75,	75,	75,	75,	75,	75,	},
{	88,	88,	88,	88,	88,	88,	88,	88,	88,	88,	88,	88,	88,	88,	88,	88,	},
{	100,	100,	100,	100,	100,	100,	100,	100,	100,	100,	100,	100,	100,	100,	100,	100,	},
{	88,	88,	88,	88,	88,	88,	88,	88,	88,	88,	88,	88,	88,	88,	88,	88,	},
{	63,	63,	63,	63,	63,	63,	63,	63,	63,	63,	63,	63,	63,	63,	63,	63,	},
{	38,	38,	38,	38,	38,	38,	38,	38,	38,	38,	38,	38,	38,	38,	38,	38,	},
{	13,	13,	13,	13,	13,	13,	13,	13,	13,	13,	13,	13,	13,	13,	13,	13,	},
{	100,	13,	13,	13,	13,	13,	13,	13,	13,	13,	13,	13,	13,	13,	13,	13,	},
{	13,	100,	13,	13,	13,	13,	13,	13,	13,	13,	13,	13,	13,	13,	13,	13,	},
{	13,	13,	100,	13,	13,	13,	13,	13,	13,	13,	13,	13,	13,	13,	13,	13,	},
{	13,	13,	13,	100,	13,	13,	13,	13,	13,	13,	13,	13,	13,	13,	13,	13,	},
{	13,	13,	13,	13,	100,	13,	13,	13,	13,	13,	13,	13,	13,	13,	13,	13,	},
{	13,	13,	13,	13,	13,	100,	13,	13,	13,	13,	13,	13,	13,	13,	13,	13,	},
{	13,	13,	13,	13,	13,	13,	100,	13,	13,	13,	13,	13,	13,	13,	13,	13,	},
{	13,	13,	13,	13,	13,	13,	13,	100,	13,	13,	13,	13,	13,	13,	13,	13,	},
{	13,	13,	13,	13,	13,	13,	13,	13,	100,	13,	13,	13,	13,	13,	13,	13,	},
{	13,	13,	13,	13,	13,	13,	13,	13,	13,	100,	13,	13,	13,	13,	13,	13,	},
{	13,	13,	13,	13,	13,	13,	13,	13,	13,	13,	100,	13,	13,	13,	13,	13,	},
{	13,	13,	13,	13,	13,	13,	13,	13,	13,	13,	13,	100,	13,	13,	13,	13,	},
{	13,	13,	13,	13,	13,	13,	13,	13,	13,	13,	13,	13,	100,	13,	13,	13,	},
{	13,	13,	13,	13,	13,	13,	13,	13,	13,	13,	13,	13,	13,	100,	13,	13,	},
{	13,	13,	13,	13,	13,	13,	13,	13,	13,	13,	13,	13,	13,	13,	100,	13,	},
{	13,	13,	13,	13,	13,	13,	13,	13,	13,	13,	13,	13,	13,	13,	13,	100,	},
{	100,	13,	13,	13,	13,	13,	13,	13,	13,	13,	13,	13,	13,	13,	13,	13,	},
{	13,	100,	13,	13,	13,	13,	13,	13,	13,	13,	13,	13,	13,	13,	13,	13,	},
{	13,	13,	100,	13,	13,	13,	13,	13,	13,	13,	13,	13,	13,	13,	13,	13,	},
{	13,	13,	13,	100,	13,	13,	13,	13,	13,	13,	13,	13,	13,	13,	13,	13,	},
{	13,	13,	13,	13,	100,	13,	13,	13,	13,	13,	13,	13,	13,	13,	13,	13,	},
{	13,	13,	13,	13,	13,	100,	13,	13,	13,	13,	13,	13,	13,	13,	13,	13,	},
{	13,	13,	13,	13,	13,	13,	100,	13,	13,	13,	13,	13,	13,	13,	13,	13,	},
{	13,	13,	13,	13,	13,	13,	13,	100,	13,	13,	13,	13,	13,	13,	13,	13,	},
{	13,	13,	13,	13,	13,	13,	13,	13,	100,	13,	13,	13,	13,	13,	13,	13,	},
{	13,	13,	13,	13,	13,	13,	13,	13,	13,	100,	13,	13,	13,	13,	13,	13,	},
{	13,	13,	13,	13,	13,	13,	13,	13,	13,	13,	100,	13,	13,	13,	13,	13,	},
{	13,	13,	13,	13,	13,	13,	13,	13,	13,	13,	13,	100,	13,	13,	13,	13,	},
{	13,	13,	13,	13,	13,	13,	13,	13,	13,	13,	13,	13,	100,	13,	13,	13,	},
{	13,	13,	13,	13,	13,	13,	13,	13,	13,	13,	13,	13,	13,	100,	13,	13,	},
{	13,	13,	13,	13,	13,	13,	13,	13,	13,	13,	13,	13,	13,	13,	100,	13,	},
{	13,	13,	13,	13,	13,	13,	13,	13,	13,	13,	13,	13,	13,	13,	13,	100,	},
{	13,	13,	13,	13,	13,	13,	13,	13,	13,	13,	13,	13,	13,	13,	100,	100,	},
{	13,	13,	13,	13,	13,	13,	13,	13,	13,	13,	13,	13,	13,	100,	100,	100,	},
{	13,	13,	13,	13,	13,	13,	13,	13,	13,	13,	13,	13,	100,	100,	100,	100,	},
{	13,	13,	13,	13,	13,	13,	13,	13,	13,	13,	13,	100,	100,	100,	100,	100,	},
{	13,	13,	13,	13,	13,	13,	13,	13,	13,	13,	100,	100,	100,	100,	100,	100,	},
{	13,	13,	13,	13,	13,	13,	13,	13,	13,	100,	100,	100,	100,	100,	100,	100,	},
{	13,	13,	13,	13,	13,	13,	13,	13,	100,	100,	100,	100,	100,	100,	100,	100,	},
{	13,	13,	13,	13,	13,	13,	13,	100,	100,	100,	100,	100,	100,	100,	100,	100,	},
{	13,	13,	13,	13,	13,	13,	100,	100,	100,	100,	100,	100,	100,	100,	100,	100,	},
{	13,	13,	13,	13,	13,	100,	100,	100,	100,	100,	100,	100,	100,	100,	100,	100,	},
{	13,	13,	13,	13,	100,	100,	100,	100,	100,	100,	100,	100,	100,	100,	100,	100,	},
{	13,	13,	13,	100,	100,	100,	100,	100,	100,	100,	100,	100,	100,	100,	100,	100,	},
{	13,	13,	100,	100,	100,	100,	100,	100,	100,	100,	100,	100,	100,	100,	100,	100,	},
{	13,	100,	100,	100,	100,	100,	100,	100,	100,	100,	100,	100,	100,	100,	100,	100,	},
{	100,	100,	100,	100,	100,	100,	100,	100,	100,	100,	100,	100,	100,	100,	100,	100,	},

};
const uint8_t Anime_Frw_Arr[][ANIME_TASK_ARR_LEN] = {
{	0,	100,	100,	100,	100,	100,	100,	100,	100,	100,	100,	100,	100,	100,	100,	100,	},
{	0,	0,	100,	100,	100,	100,	100,	100,	100,	100,	100,	100,	100,	100,	100,	100,	},
{	0,	0,	0,	100,	100,	100,	100,	100,	100,	100,	100,	100,	100,	100,	100,	100,	},
{	0,	0,	0,	0,	100,	100,	100,	100,	100,	100,	100,	100,	100,	100,	100,	100,	},
{	0,	0,	0,	0,	0,	100,	100,	100,	100,	100,	100,	100,	100,	100,	100,	100,	},
{	0,	0,	0,	0,	0,	0,	100,	100,	100,	100,	100,	100,	100,	100,	100,	100,	},
{	0,	0,	0,	0,	0,	0,	0,	100,	100,	100,	100,	100,	100,	100,	100,	100,	},
{	0,	0,	0,	0,	0,	0,	0,	0,	100,	100,	100,	100,	100,	100,	100,	100,	},
{	0,	0,	0,	0,	0,	0,	0,	0,	0,	100,	100,	100,	100,	100,	100,	100,	},
{	0,	0,	0,	0,	0,	0,	0,	0,	0,	0,	100,	100,	100,	100,	100,	100,	},
{	0,	0,	0,	0,	0,	0,	0,	0,	0,	0,	0,	100,	100,	100,	100,	100,	},
{	0,	0,	0,	0,	0,	0,	0,	0,	0,	0,	0,	0,	100,	100,	100,	100,	},
{	0,	0,	0,	0,	0,	0,	0,	0,	0,	0,	0,	0,	0,	100,	100,	100,	},
{	0,	0,	0,	0,	0,	0,	0,	0,	0,	0,	0,	0,	0,	0,	100,	100,	},
{	0,	0,	0,	0,	0,	0,	0,	0,	0,	0,	0,	0,	0,	0,	0,	100,	},
{	0,	0,	0,	0,	0,	0,	0,	0,	0,	0,	0,	0,	0,	0,	0,	0,	},
};

const Anime_Target_Info_t tAnime_Target_Info[ANIME_MODE_MAX] = 
{
    {
        .u8target_mode = ANIME_MODE_DRL_ON,
        .u16target_delay = 0,
        .u8target_steps = 1,
        .u8target_reload_times = 0,
        .pu8target_arr = Anime_DRL_AllOn_Arr,
    },
    {
        .u8target_mode = ANIME_MODE_PL_ON,
        .u16target_delay = 0,
        .u8target_steps = 1,
        .u8target_reload_times = 0,
        .pu8target_arr = Anime_PL_AllOn_Arr,    
    },
    {
        .u8target_mode = ANIME_MODE_WEL,
        .u16target_delay = 0,
        .u8target_steps = 70,
        .u8target_reload_times = 0,
        .pu8target_arr = Anime_Wel_Arr,    
    },
    {
        .u8target_mode = ANIME_MODE_PL_ON,
        .u16target_delay = 0,
        .u8target_steps = 16,
        .u8target_reload_times = 0,
        .pu8target_arr = Anime_Frw_Arr,    
    },
};
Anime_Input_Info_t tInput_Info;
Anime_Running_Info_t tAnime_Running_Info = {0};                     /*动画运行信息*/

void Anmie_Arr_Execute(const uint8_t *input_arr)
{

}

/**
 * @breif: 
 * @note: 
 * @param [in] *ptinput_info
 * @param [in] mode
 * @param [in] factor
 * @return [*]
 */
uint8_t Anime_InputInfo_Init(Anime_Input_Info_t *ptinput_info, uint8_t mode, void (*func)(const uint8_t*))
{
    uint8_t res = 0;
    ptinput_info->tinput_mode = (Anime_Mode_t)mode;
    ptinput_info->bfeedback_runtoend = true;
    if (func != NULL)
    {
        ptinput_info->tinput_func = func;
        res = 0;
    }
    else
    {
        res = 1;
    }

    return res;
}

/**
 * @breif: 
 * @note: 
 * @param [in] *ptinput_info
 * @param [in] *ptrun_info
 * @param [in] *ptarget_info
 * @return [*]
 */
void Anime_Task_Run(Anime_Input_Info_t *ptinput_info,Anime_Running_Info_t *ptrun_info, Anime_Target_Info_t const *ptarget_info)
{
    static uint8_t reload_cnt = 0;
    bool process_pass = false;
    uint8_t i = 0;

    if (ptinput_info != NULL && ptrun_info != NULL && ptarget_info != NULL)     /*指针校验*/
    {
        for (i = 0; i < ANIME_MODE_MAX; i++)
        {
            if (ptinput_info->tinput_mode == ptarget_info[i].u8target_mode)     /*检查输入动画模式是否匹配*/
            {
                ptrun_info->u8run_curr_mode = ptinput_info->tinput_mode;        /*传递输入模式*/
                reload_cnt = 0;
                process_pass = true;
                break;
            }
            process_pass = false;
        }
    }
    else
    {
        process_pass = false;
    }

    if (process_pass)
    {
        ptrun_info->u16run_timercnt += ANIME_TASK_TIMERCNT;             /*定时器计数累加*/
        ptrun_info->u16run_delaycnt += ANIME_TASK_TIMERCNT;

        if (ptrun_info->u8run_last_mode != ptrun_info->u8run_curr_mode) /*模式变化，新状态打断旧状态*/
        {
            ptrun_info->u16run_step_index = 0; /*重置动画索引*/
            ptrun_info->u16run_delaycnt = 0;  /*重置延时*/
            ptrun_info->u8run_last_mode = ptrun_info->u8run_curr_mode;
        }

        if (ptrun_info->u16run_delaycnt >= ptarget_info[i].u16target_delay) /*达到对应延时时间*/
        {
            ptrun_info->u16run_delaycnt = ptarget_info[i].u16target_delay;                          /*保持延时到达时间*/
            ptinput_info->tinput_func(ptarget_info[i].pu8target_arr[ptrun_info->u16run_step_index]); /*执行动画数组*/
            if (ptrun_info->u16run_timercnt >= ANIME_TASK_TIMEREXPIERED)                            /*定时器超时进入*/
            {
                ptrun_info->u16run_timercnt -= ANIME_TASK_TIMEREXPIERED;
                if (ptrun_info->u16run_step_index < ptarget_info[i].u8target_steps - 1) /*动画未结束*/
                {
                    ptrun_info->u16run_step_index++; /*动画步骤累加*/
                    ptinput_info->bfeedback_runtoend = false;
                }
                else
                {
                    if (reload_cnt < ptarget_info[i].u8target_reload_times)
                    {
                        reload_cnt ++;
                        ptrun_info->u16run_step_index = 0; /*动画结束进入循环*/
                        ptinput_info->bfeedback_runtoend = false;
                    }
                    else
                    {
                        reload_cnt = ptarget_info[i].u8target_reload_times;
                        ptrun_info->u16run_step_index = ptarget_info[i].u8target_steps - 1; /*动画结束保持最后状态*/
                        ptinput_info->bfeedback_runtoend = true;
                    }
                }
            }
        }
        else
        {
            ptrun_info->u16run_delaycnt = 0; /*未到达延时不增加动画分辨率计数*/
        }
    }
}
